const { 打印, 固定循环, 条件循环, 数组工具 } = require("./cnCode")
打印.日志("666") //输出:666
打印.报错("啥") //输出:啥


固定循环({ 次数: 3, 动作: (n) => 打印.日志(`第${n}次`) })
/*
输出:
第1次
第2次
第3次
 */
let n1 = "嘎"
条件循环(
    {
        条件函数: () => n1 != "嘎嘎嘎嘎嘎", //条件函数返回布尔值 当返回值为false时 停止动作
        动作函数: () => {

            n1 += "嘎"
            打印.日志(n1)

        },
        前置运行: true,//可选 默认不前置运行一次
        结束动作: (n) => { //可选 会默认传入运行次数
            打印.日志(`结束了一共运行了${n}遍`,)
        }

    })
/*
输出:
嘎嘎
嘎嘎嘎
嘎嘎嘎嘎
嘎嘎嘎嘎嘎
结束了一共运行了4遍
*/




const arr1 = [1,2,3,4,5,6,"非常溜",7,8,90,0,2,3,4,5,"无敌","很强"]
const arr2 = 数组工具.切片(arr1,-5,-1)
const arr3 = 数组工具.切片(arr1,0,-1)

打印.日志(arr2);
//输出: [ 3, 4, 5, '无敌', '很强' ]

打印.日志(arr3);
//输出:[1,2,3,4,5,6,"非常溜",7,8,90,0,2,3,4,5,"无敌","很强"]

const arr4 = 数组工具.去重(arr1)
打印.日志(arr4);
//输出:[1,2,3,4,5,6,"非常溜",7,8,90,0,"无敌","很强"]

数组工具.删除元素("非常溜",arr4)
打印.日志(arr4);
//输出:[1,2,3,4,5,6,7,8,90,0,"无敌","很强"]
